Revit 2027 API
BuiltInFailures.RoofFailures.InvalidArcSegmentation Property
 A segmented slope-defining arc has too few segments.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidArcSegmentation { get; }
Public Shared ReadOnly Property InvalidArcSegmentation As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidArcSegmentation {
	FailureDefinitionId^ get ();
}
static member InvalidArcSegmentation : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace